tutorials/turbulentFlameletRhoSimplecFoam/SANDIA_CH4H2N2/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //                                        
                                        
convertToMeters 1;                  
                                        
vertices                                
(                                       
   (0 0 0)   					// 0
   (0.003996192886 0  0.000174477549)   	// 1
   (0.003996192886 0 -0.000174477549)   	// 2

   (0 0.05 0)	   				// 3
   (0.003996192886 0.05  0.000174477549)   	// 4
   (0.003996192886 0.05 -0.000174477549)   	// 5

   (0 1 0)	   				// 6
   (0.003996192886 1  0.000174477549)   	// 7
   (0.003996192886 1 -0.000174477549)   	// 8

   (0.008366246190 0  0.000365278197)   	// 9
   (0.008366246190 0  -0.000365278197)   	// 10
   (0.199809644316 0  0.008723877473) 	 	// 11
   (0.199809644316 0  -0.008723877473)	 	// 12
   (0.199809644316 0.05  0.008723877473) 	// 13
   (0.199809644316 0.05  -0.008723877473) 	// 14


   (0.199809644316 1  0.008723877473) 	// 13
   (0.199809644316 1  -0.008723877473) 	// 14
);

blocks
( 				    //(h  e  v )	
	hex (0 1 2 0 3 4 5 3)         (4  1  25)   simpleGrading (1 1 0.4)
	hex (3 4 5 3 6 7 8 6)         (4  1  150)    simpleGrading (1 1 15)
	hex (9 11 12 10 4 13 14 5)    (50  1  25)   simpleGrading (7 1 0.4)
	hex (4 13 14 5 7 15 16 8)     (50 1 150)   simpleGrading (7 1 15)

);
                                     
edges                                
(                                    
);                                   
                                     
patches                              
(                                    
    patch inletfuel                  
    (                                
        (0 1 2 0)                    
    )                                
                                     
    patch inletair                   
    (                                
        (9 11 12 10)
    )                                
                     
                
    patch outlet                     
    (
	(6 7 8 6)
	(7 15 16 8)
    )                                
                                     
    empty axis                       
    (                                
        (0 3 3 0)                    
        (3 6 6 3)                    
    )                                
    
                                 
    wall sidewall
    (                                    
	(11 13 14 12)
	(13 15 16 14)
    )                                

                                     
    wall burnerwall                  
    (                                
        (1 4 5 2)                    
        (4 9 10 5)                 
    )                                
                                     
    wedge front                      
    (
	(0 1 4 3)
	(3 4 7 6)

	(9 11 13 4)
	(4 13 15 7)
    )                                
                                     
    wedge back                       
    (
	(0 2 5 3)
	(3 5 8 6)
	
	(10 12 14 5)
	(5 14 16 8)

    )                     
                                     
);                                   
                                     
mergePatchPairs                      
(                                    
);                                   
					    
