tutorials/turbulentFlameletRhoSimplecFoam/SANDIA_CH4H2N2/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 101325;

boundaryField
{
    inletfuel           
    {
        type            zeroGradient;
    }

    inletair           
    {
        type            zeroGradient;
    }

    "outlet"
    {
        type            fixedValue;
        value           $internalField;
    }

    sidewall
    {
	type		zeroGradient;
    }

    burnerwall       
    {
        type            zeroGradient;
    }

    front    
    {
        type            wedge;
    }

    back   
    {
        type            wedge;
    }

    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
