tutorials/turbulentFlameletRhoSimplecFoam/SANDIA_CH4H2N2/Allrun
#!/bin/bash

cp -r 0.org 0
blockMesh
turbulentFlameletRhoSimplecFoam > log & tail -f log

